weber-lin-nthu/Sysmaker_QEMU/hw/misc/stm32f429_rcc.c
    for (i = 0; i < RCC_NUM_CHANNEL_PLL_OUT; i++) {
        if (!pll->channel_exists[i]) {
            continue;
        }

        old_channel_freq = clock_get_hz(pll->channels[i]);
        if (bypass_source ||
            !pll->enabled ||
            !pll->channel_enabled[i] ||
            !pll->channel_divider[i]) {
            channel_freq = 0;
        } else {
            channel_freq = muldiv64(vco_freq,
                                    1,
                                    pll->channel_divider[i]);
        }

        /* No change, early continue to avoid log spam and useless propagation */
        if (old_channel_freq == channel_freq) {
            continue;
        }

        clock_update_hz(pll->channels[i], channel_freq);
        trace_stm32f429_rcc_pll_update(pll->id, i, vco_freq,
                                       old_channel_freq, channel_freq);
    }
}

static void pll_src_update(void *opaque, ClockEvent event)
{
    RccPllState *s = opaque;
    pll_update(s, false);
}

static void pll_init(Object *obj)
{
    RccPllState *s = RCC_PLL(obj);
    size_t i;

    s->in = qdev_init_clock_in(DEVICE(s), "in",
                               pll_src_update, s, ClockUpdate);

    const char *names[] = {
        "out-p",
        "out-q",
        "out-r",
    };

    for (i = 0; i < RCC_NUM_CHANNEL_PLL_OUT; i++) {
        s->channels[i] = qdev_init_clock_out(DEVICE(s), names[i]);
    }
}

static void pll_reset_enter(Object *obj, ResetType type)
{
    RccPllState *s = RCC_PLL(obj);
    set_pll_init_info(s, s->id);
}

static void pll_reset_hold(Object *obj)
{
    RccPllState *s = RCC_PLL(obj);
    pll_update(s, true);
}

static void pll_reset_exit(Object *obj)
{
    RccPllState *s = RCC_PLL(obj);
    pll_update(s, false);
}

static const VMStateDescription pll_vmstate = {
    .name               = TYPE_RCC_PLL,
    .version_id         = 1,
    .minimum_version_id = 1,
    .fields             = (VMStateField[]){
        VMSTATE_UINT32(id, RccPllState),
        VMSTATE_CLOCK(in, RccPllState),
        VMSTATE_ARRAY_CLOCK(channels, RccPllState,
                                        RCC_NUM_CHANNEL_PLL_OUT),
        VMSTATE_BOOL(enabled, RccPllState),
        VMSTATE_UINT32(vco_multiplier, RccPllState),
        VMSTATE_BOOL_ARRAY(channel_enabled, RccPllState, RCC_NUM_CHANNEL_PLL_OUT),
        VMSTATE_BOOL_ARRAY(channel_exists, RccPllState, RCC_NUM_CHANNEL_PLL_OUT),
        VMSTATE_UINT32_ARRAY(channel_divider, RccPllState, RCC_NUM_CHANNEL_PLL_OUT),
        VMSTATE_END_OF_LIST()}};

static void pll_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc     = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    rc->phases.enter = pll_reset_enter;
    rc->phases.hold  = pll_reset_hold;
    rc->phases.exit  = pll_reset_exit;
    dc->vmsd         = &pll_vmstate;
}

static void pll_set_vco_multiplier(RccPllState *pll, uint32_t vco_multiplier)
{
    if (pll->vco_multiplier == vco_multiplier) {
        return;
    }

    if (vco_multiplier < 8 || vco_multiplier > 86) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: VCO multiplier is out of bound (%u) for PLL %u\n",
                      __func__, vco_multiplier, pll->id);
        return;
    }

    trace_stm32f429_rcc_pll_set_vco_multiplier(pll->id,
                                               pll->vco_multiplier, vco_multiplier);

    pll->vco_multiplier = vco_multiplier;
    pll_update(pll, false);
}

static void pll_set_enable(RccPllState *pll, bool enabled)
{
    if (pll->enabled == enabled) {
        return;
    }

    pll->enabled = enabled;
    pll_update(pll, false);
}

// static void pll_set_channel_enable(RccPllState *pll,
//                                    PllCommonChannels channel,
//                                    bool enabled)
// {
//     if (pll->channel_enabled[channel] == enabled) {
//         return;
//     }

//     if (enabled) {
//         trace_stm32f429_rcc_pll_channel_enable(pll->id, channel);
//     } else {
//         trace_stm32f429_rcc_pll_channel_disable(pll->id, channel);
//     }

//     pll->channel_enabled[channel] = enabled;
//     pll_update(pll, false);
// }

static void pll_set_channel_divider(RccPllState *pll,
                                    PllCommonChannels channel,
                                    uint32_t divider)
{
    if (pll->channel_divider[channel] == divider) {
        return;
    }

    trace_stm32f429_rcc_pll_set_channel_divider(pll->id,
                                                channel, pll->channel_divider[channel], divider);

    pll->channel_divider[channel] = divider;
    pll_update(pll, false);
}

static int ppre_factor(int val)
{
    if (val < 0b100) {
        return 1;
    } else {
        return 1 << (val - 0b11);
    }
}

static void rcc_update_timpre(Stm32f429RccState *s)
{
    RccClockMux const TIMER_MUXS[] = {
        RCC_CLOCK_MUX_TIM2,
        RCC_CLOCK_MUX_TIM3,
        RCC_CLOCK_MUX_TIM4,
        RCC_CLOCK_MUX_TIM5,
    };
    int val           = FIELD_EX32(s->dckcfgr, DCKCFGR, TIMPRE);
    int apb_prescaler = ppre_factor(FIELD_EX32(s->cfgr, CFGR, PPRE1));
    if (val == 0) {
        if (apb_prescaler == 1) {
            for (int i = 0; i < ARRAY_SIZE(TIMER_MUXS); ++i) {
                RccClockMux tim_mux = TIMER_MUXS[i];
                clock_mux_set_factor(&s->clock_muxes[tim_mux], 1, 1);
            }
        } else {
            for (int i = 0; i < ARRAY_SIZE(TIMER_MUXS); ++i) {
                RccClockMux tim_mux = TIMER_MUXS[i];
                clock_mux_set_factor(&s->clock_muxes[tim_mux], 2, 1);
            }
        }
    } else if (val == 1) {
        if (apb_prescaler == 1 || apb_prescaler == 2 || apb_prescaler == 4) {
            for (int i = 0; i < ARRAY_SIZE(TIMER_MUXS); ++i) {
                RccClockMux tim_mux = TIMER_MUXS[i];
                clock_mux_set_factor(&s->clock_muxes[tim_mux], 1, 1);
            }
        } else {
            for (int i = 0; i < ARRAY_SIZE(TIMER_MUXS); ++i) {
                RccClockMux tim_mux = TIMER_MUXS[i];
                clock_mux_set_factor(&s->clock_muxes[tim_mux], 4, 1);
            }
        }
    }
}

static void rcc_update_irq(Stm32f429RccState *s)
{
    /*
     * TODO: Handle LSECSSF and CSSF flags when the CSS is implemented.
     */
    // if (s->cifr & CIFR_IRQ_MASK) {
    //     qemu_irq_raise(s->irq);
    // } else {
    //     qemu_irq_lower(s->irq);
    // }
}

