weber-lin-nthu/Sysmaker_QEMU/hw/misc/stm32f429_rcc.c
    /* STOPWUCK */
    /* TODO */

    /* PPRE2 */
    val = FIELD_EX32(s->cfgr, CFGR, PPRE2);
    clock_mux_set_factor(&s->clock_muxes[RCC_CLOCK_MUX_PCLK2],
                         1, ppre_factor(val));

    /* PPRE1 */
    val = FIELD_EX32(s->cfgr, CFGR, PPRE1);
    clock_mux_set_factor(&s->clock_muxes[RCC_CLOCK_MUX_PCLK1],
                         1, ppre_factor(val));

    /* when updating PPRE1/2, TIMPRE might also be changed */
    rcc_update_timpre(s);

    /* HPRE */
    val = FIELD_EX32(s->cfgr, CFGR, HPRE);
    if (val < 0b1000) {
        clock_mux_set_factor(&s->clock_muxes[RCC_CLOCK_MUX_HCLK],
                             1, 1);
    } else {
        clock_mux_set_factor(&s->clock_muxes[RCC_CLOCK_MUX_HCLK],
                             1, 1 << (val - 0b111));
    }

    /* Update SWS */
    val = FIELD_EX32(s->cfgr, CFGR, SW);
    clock_mux_set_source(&s->clock_muxes[RCC_CLOCK_MUX_SYSCLK],
                         val);
    s->cfgr &= ~R_CFGR_SWS_MASK;
    s->cfgr |= val << R_CFGR_SWS_SHIFT;
}

// static void rcc_update_ahb1enr(Stm32f429RccState *s)
// {
#define AHB1ENR_SET_ENABLE(_peripheral_name)                                \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->ahb1enr, AHB1ENR, _peripheral_name##EN))

//     /* DMA2DEN: reserved for STM32L475xx */
//     AHB1ENR_SET_ENABLE(TSC);
//     AHB1ENR_SET_ENABLE(CRC);
//     AHB1ENR_SET_ENABLE(FLASH);
//     AHB1ENR_SET_ENABLE(DMA2);
//     AHB1ENR_SET_ENABLE(DMA1);

#undef AHB1ENR_SET_ENABLE
// }

// static void rcc_update_ahb2enr(Stm32f429RccState *s)
// {
#define AHB2ENR_SET_ENABLE(_peripheral_name)                                \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->ahb2enr, AHB2ENR, _peripheral_name##EN))

//     AHB2ENR_SET_ENABLE(RNG);
//     /* HASHEN: reserved for STM32L475xx */
//     AHB2ENR_SET_ENABLE(AES);
//     /* DCMIEN: reserved for STM32L475xx */
//     AHB2ENR_SET_ENABLE(ADC);
//     AHB2ENR_SET_ENABLE(OTGFS);
//     /* GPIOIEN: reserved for STM32L475xx */
//     AHB2ENR_SET_ENABLE(GPIOA);
//     AHB2ENR_SET_ENABLE(GPIOB);
//     AHB2ENR_SET_ENABLE(GPIOC);
//     AHB2ENR_SET_ENABLE(GPIOD);
//     AHB2ENR_SET_ENABLE(GPIOE);
//     AHB2ENR_SET_ENABLE(GPIOF);
//     AHB2ENR_SET_ENABLE(GPIOG);
//     AHB2ENR_SET_ENABLE(GPIOH);

#undef AHB2ENR_SET_ENABLE
// }

// static void rcc_update_ahb3enr(Stm32f429RccState *s)
// {
#define AHB3ENR_SET_ENABLE(_peripheral_name)                                \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->ahb3enr, AHB3ENR, _peripheral_name##EN))

//     AHB3ENR_SET_ENABLE(QSPI);
//     AHB3ENR_SET_ENABLE(FMC);

#undef AHB3ENR_SET_ENABLE
// }

static void rcc_update_apb1enr(Stm32f429RccState *s)
{
#define APB1ENR1_SET_ENABLE(_peripheral_name)                               \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->apb1enr1, APB1ENR1, _peripheral_name##EN))
#define APB1ENR2_SET_ENABLE(_peripheral_name)                               \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->apb1enr2, APB1ENR2, _peripheral_name##EN))

    //     /* APB1ENR1 */
    //     APB1ENR1_SET_ENABLE(LPTIM1);
    //     APB1ENR1_SET_ENABLE(OPAMP);
    //     APB1ENR1_SET_ENABLE(DAC1);
    //     APB1ENR1_SET_ENABLE(PWR);
    //     /* CAN2: reserved for STM32F429 */
    //     APB1ENR1_SET_ENABLE(CAN1);
    //     /* CRSEN: reserved for STM32F429 */
    //     APB1ENR1_SET_ENABLE(I2C3);
    //     APB1ENR1_SET_ENABLE(I2C2);
    //     APB1ENR1_SET_ENABLE(I2C1);
    //     APB1ENR1_SET_ENABLE(UART5);
    //     APB1ENR1_SET_ENABLE(UART4);
    //     APB1ENR1_SET_ENABLE(USART3);
    //     APB1ENR1_SET_ENABLE(USART2);
    //     APB1ENR1_SET_ENABLE(SPI3);
    //     APB1ENR1_SET_ENABLE(SPI2);
    //     APB1ENR1_SET_ENABLE(WWDG);
    //     /* RTCAPB: reserved for STM32F429 */
    //     APB1ENR1_SET_ENABLE(LCD);
    //     APB1ENR1_SET_ENABLE(TIM7);
    //     APB1ENR1_SET_ENABLE(TIM6);
    APB1ENR1_SET_ENABLE(TIM5);
    APB1ENR1_SET_ENABLE(TIM4);
    APB1ENR1_SET_ENABLE(TIM3);
    APB1ENR1_SET_ENABLE(TIM2);

    //     /* APB1ENR2 */
    //     APB1ENR2_SET_ENABLE(LPTIM2);
    //     APB1ENR2_SET_ENABLE(SWPMI1);
    //     /* I2C4EN: reserved for STM32F429 */
    //     APB1ENR2_SET_ENABLE(LPUART1);

#undef APB1ENR1_SET_ENABLE
#undef APB1ENR2_SET_ENABLE
}

// static void rcc_update_apb2enr(Stm32f429RccState *s)
// {
#define APB2ENR_SET_ENABLE(_peripheral_name)                                \
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->apb2enr, APB2ENR, _peripheral_name##EN))

//     APB2ENR_SET_ENABLE(DFSDM1);
//     APB2ENR_SET_ENABLE(SAI2);
//     APB2ENR_SET_ENABLE(SAI1);
//     APB2ENR_SET_ENABLE(TIM17);
//     APB2ENR_SET_ENABLE(TIM16);
//     APB2ENR_SET_ENABLE(TIM15);
//     APB2ENR_SET_ENABLE(USART1);
//     APB2ENR_SET_ENABLE(TIM8);
//     APB2ENR_SET_ENABLE(SPI1);
//     APB2ENR_SET_ENABLE(TIM1);
//     APB2ENR_SET_ENABLE(SDMMC1);
//     APB2ENR_SET_ENABLE(FW);
//     APB2ENR_SET_ENABLE(SYSCFG);

#undef APB2ENR_SET_ENABLE
// }

/*
 * Note: no frequency bounds checking is done here.
 */
static void rcc_update_plli2scfgr(Stm32f429RccState *s)
{
    uint32_t reg = s->plli2scfgr, val;

    /* Get R value */
    val = FIELD_EX32(reg, PLLI2SCFGR, PLLI2SR);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLLI2S], RCC_PLL_COMMON_CHANNEL_R,
                            val);

    /* Get Q value */
    val = FIELD_EX32(reg, PLLI2SCFGR, PLLI2SQ);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLLI2S], RCC_PLL_COMMON_CHANNEL_Q,
                            val);

    /* PLLN */
    val = FIELD_EX32(reg, PLLI2SCFGR, PLLI2SN);
    pll_set_vco_multiplier(&s->plls[RCC_PLL_PLLI2S], val);
}

