weber-lin-nthu/Sysmaker_QEMU/hw/misc/stm32f429_rcc.c
/*
 * Note: no frequency bounds checking is done here.
 */
static void rcc_update_pllsaicfgr(Stm32f429RccState *s)
{
    uint32_t reg = s->pllsaicfgr, val;

    /* Get R value */
    val = FIELD_EX32(reg, PLLSAICFGR, PLLSAIR);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLLSAI], RCC_PLL_COMMON_CHANNEL_R,
                            val);

    /* Get Q value */
    val = FIELD_EX32(reg, PLLSAICFGR, PLLSAIQ);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLLSAI], RCC_PLL_COMMON_CHANNEL_Q,
                            val);

    /* PLLN */
    val = FIELD_EX32(reg, PLLSAICFGR, PLLSAIN);
    pll_set_vco_multiplier(&s->plls[RCC_PLL_PLLSAI], val);
}

static void rcc_update_pllcfgr(Stm32f429RccState *s)
{
    int val;

    /* Get Q value */
    val = FIELD_EX32(s->pllcfgr, PLLCFGR, PLLQ);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLL], RCC_PLL_COMMON_CHANNEL_Q,
                            val);

    /* PLLSRC */
    val = FIELD_EX32(s->pllcfgr, PLLCFGR, PLLSRC);
    clock_mux_set_source(&s->clock_muxes[RCC_CLOCK_MUX_PLL_INPUT], val);
    clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_PLL_INPUT], true);

    /* Get P value */
    val = FIELD_EX32(s->pllcfgr, PLLCFGR, PLLP);
    pll_set_channel_divider(&s->plls[RCC_PLL_PLL], RCC_PLL_COMMON_CHANNEL_P,
                            2 + 2 * val);

    /* PLLN */
    val = FIELD_EX32(s->pllcfgr, PLLCFGR, PLLN);
    assert(50 <= val && val <= 432);
    pll_set_vco_multiplier(&s->plls[RCC_PLL_PLL], val);

    /* PLLM */
    val = FIELD_EX32(s->pllcfgr, PLLCFGR, PLLM);
    assert(2 <= val && val <= 63);
    clock_mux_set_factor(&s->clock_muxes[RCC_CLOCK_MUX_PLL_INPUT], 1, val);
}

// static void rcc_update_ccipr(Stm32f429RccState *s)
// {
#define CCIPR_SET_SOURCE(_peripheral_name)                                  \
    clock_mux_set_source(&s->clock_muxes[RCC_CLOCK_MUX_##_peripheral_name], \
                         FIELD_EX32(s->ccipr, CCIPR, _peripheral_name##SEL))

//     CCIPR_SET_SOURCE(DFSDM1);
//     CCIPR_SET_SOURCE(SWPMI1);
//     CCIPR_SET_SOURCE(ADC);
//     CCIPR_SET_SOURCE(CLK48);
//     CCIPR_SET_SOURCE(SAI2);
//     CCIPR_SET_SOURCE(SAI1);
//     CCIPR_SET_SOURCE(LPTIM2);
//     CCIPR_SET_SOURCE(LPTIM1);
//     CCIPR_SET_SOURCE(I2C3);
//     CCIPR_SET_SOURCE(I2C2);
//     CCIPR_SET_SOURCE(I2C1);
//     CCIPR_SET_SOURCE(LPUART1);
//     CCIPR_SET_SOURCE(UART5);
//     CCIPR_SET_SOURCE(UART4);
//     CCIPR_SET_SOURCE(USART3);
//     CCIPR_SET_SOURCE(USART2);
//     CCIPR_SET_SOURCE(USART1);

#undef CCIPR_SET_SOURCE
// }

// static void rcc_update_bdcr(Stm32f429RccState *s)
// {
//     int val;

//     /* LSCOSEL */
//     val = FIELD_EX32(s->bdcr, BDCR, LSCOSEL);
//     clock_mux_set_source(&s->clock_muxes[RCC_CLOCK_MUX_LSCO], val);

//     val = FIELD_EX32(s->bdcr, BDCR, LSCOEN);
//     clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_LSCO], val);

//     /* BDRST */
//     /*
//      * The documentation is not clear if the RTCEN flag disables the RTC and
//      * the LCD common mux or if it only affects the RTC.
//      * As the LCDEN flag exists, we assume here that it only affects the RTC.
//      */
//     val = FIELD_EX32(s->bdcr, BDCR, RTCEN);
//     clock_mux_set_enable(&s->clock_muxes[RCC_CLOCK_MUX_RTC], val);
//     /* LCD and RTC share the same clock */
//     val = FIELD_EX32(s->bdcr, BDCR, RTCSEL);
//     clock_mux_set_source(&s->clock_muxes[RCC_CLOCK_MUX_LCD_AND_RTC_COMMON], val);

//     /* LSECSSON */
//     /* LSEDRV[1:0] */
//     /* LSEBYP */

//     /* LSEON: Update LSERDY at the same time */
//     val = FIELD_EX32(s->bdcr, BDCR, LSEON);
//     if (val) {
//         clock_update_hz(s->lse_crystal, LSE_FRQ);
//         s->bdcr |= R_BDCR_LSERDY_MASK;
//         if (s->cier & R_CIER_LSERDYIE_MASK) {
//             s->cifr |= R_CIFR_LSERDYF_MASK;
//         }
//     } else {
//         clock_update(s->lse_crystal, 0);
//         s->bdcr &= ~R_BDCR_LSERDY_MASK;
//     }

//     rcc_update_irq(s);
// }

// static void rcc_update_csr(Stm32f429RccState *s)
// {
//     int val;

//     /* Reset flags: Not implemented */
//     /* MSISRANGE: Not implemented after reset */

//     /* LSION: Update LSIRDY at the same time */
//     val = FIELD_EX32(s->csr, CSR, LSION);
//     if (val) {
//         clock_update_hz(s->lsi_rc, LSI_FRQ);
//         s->csr |= R_CSR_LSIRDY_MASK;
//         if (s->cier & R_CIER_LSIRDYIE_MASK) {
//             s->cifr |= R_CIFR_LSIRDYF_MASK;
//         }
//     } else {
//         /*
//          * TODO: Handle when the LSI is set independently of LSION.
//          * E.g. when the LSI is set by the RTC.
//          * See the reference manual for more details.
//          */
//         clock_update(s->lsi_rc, 0);
//         s->csr &= ~R_CSR_LSIRDY_MASK;
//     }

//     rcc_update_irq(s);
// }

static void rcc_update_dckcfgr(Stm32f429RccState *s)
{
    /* update TIMPRE */
    rcc_update_timpre(s);

    /* TODO: SAI1BSRC */
    /* TODO: SAI1ASRC */
    /* TODO: PLLSAIDIVR */
    /* TODO: PLLSAIDIVQ */
    /* TODO: PLLI2SDIVQ */
}

static void stm32f429_rcc_reset_hold(Object *obj)
{
    Stm32f429RccState *s = STM32F429_RCC(obj);
    s->cr                = 0x00000083;
    /*
     * Factory-programmed calibration data
     * From the reference manual: 0x10XX 00XX
     * Value taken from a real card.
     */
    s->pllcfgr    = 0x24003010;
    s->cfgr       = 0x0;
    s->cir        = 0x0;
    s->pllsaicfgr = 0x24003000;
    // s->cier        = 0x0;
    // s->cifr        = 0x0;
    // s->ahb1rstr    = 0x0;
    // s->ahb2rstr    = 0x0;
    // s->ahb3rstr    = 0x0;
    // s->apb1rstr1   = 0x0;
    // s->apb1rstr2   = 0x0;
    // s->apb2rstr    = 0x0;
    // s->ahb1enr     = 0x00000100;
    // s->ahb2enr     = 0x0;
    // s->ahb3enr     = 0x0;
    s->apb1enr1 = 0x0;
    // s->apb1enr2    = 0x0;
    // s->apb2enr     = 0x0;
    // s->ahb1smenr   = 0x00011303;
    // s->ahb2smenr   = 0x000532FF;
    // s->ahb3smenr   = 0x00000101;
    // s->apb1smenr1  = 0xF2FECA3F;
    // s->apb1smenr2  = 0x00000025;
    // s->apb2smenr   = 0x01677C01;
    // s->ccipr       = 0x0;
    // s->bdcr        = 0x0;
    // s->csr         = 0x0C000600;
    s->dckcfgr = 0x0;
}

static uint64_t stm32f429_rcc_read(void *opaque, hwaddr addr,
                                   unsigned int size)
{
    Stm32f429RccState *s = opaque;
    uint64_t retvalue    = 0;

    switch (addr) {
    case A_CR:
        retvalue = s->cr;
        break;
    case A_PLLCFGR:
        retvalue = s->pllcfgr;
        break;
    case A_CFGR:
        retvalue = s->cfgr;
        break;
    case A_CIR:
        retvalue = s->cir;
        break;
    case A_PLLSAICFGR:
        retvalue = s->pllsaicfgr;
        break;
    // case A_PLLSAI2CFGR:
    //     retvalue = s->pllsai2cfgr;
    //     break;
    // case A_AHB1RSTR:
    //     retvalue = s->ahb1rstr;
    //     break;
    // case A_AHB2RSTR:
    //     retvalue = s->ahb2rstr;
    //     break;
    // case A_AHB3RSTR:
    //     retvalue = s->ahb3rstr;
    //     break;
    // case A_APB1RSTR1:
    //     retvalue = s->apb1rstr1;
    //     break;
    // case A_APB1RSTR2:
    //     retvalue = s->apb1rstr2;
    //     break;
    // case A_APB2RSTR:
    //     retvalue = s->apb2rstr;
    //     break;
    // case A_AHB1ENR:
    //     retvalue = s->ahb1enr;
    //     break;
    // case A_AHB2ENR:
    //     retvalue = s->ahb2enr;
    //     break;
    // case A_AHB3ENR:
    //     retvalue = s->ahb3enr;
    //     break;
    case A_APB1ENR1:
        retvalue = s->apb1enr1;
        break;
    // case A_APB1ENR2:
    //     retvalue = s->apb1enr2;
    //     break;
    // case A_APB2ENR:
    //     retvalue = s->apb2enr;
    //     break;
    // case A_AHB1SMENR:
    //     retvalue = s->ahb1smenr;
    //     break;
    // case A_AHB2SMENR:
    //     retvalue = s->ahb2smenr;
    //     break;
    // case A_AHB3SMENR:
    //     retvalue = s->ahb3smenr;
    //     break;
    // case A_APB1SMENR1:
    //     retvalue = s->apb1smenr1;
    //     break;
    // case A_APB1SMENR2:
    //     retvalue = s->apb1smenr2;
    //     break;
    // case A_APB2SMENR:
    //     retvalue = s->apb2smenr;
    //     break;
    // case A_CCIPR:
    //     retvalue = s->ccipr;
    //     break;
    // case A_BDCR:
    //     retvalue = s->bdcr;
    //     break;
    // case A_CSR:
    //     retvalue = s->csr;
    //     break;
    case A_DCKCFGR:
        retvalue = s->dckcfgr;
        break;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%" HWADDR_PRIx "\n", __func__, addr);
        break;
    }

    trace_stm32f429_rcc_read(addr, retvalue);

