weber-lin-nthu/Sysmaker_QEMU/hw/misc/stm32f429_rcc.c
    return retvalue;
}

static void stm32f429_rcc_write(void *opaque, hwaddr addr,
                                uint64_t val64, unsigned int size)
{
    Stm32f429RccState *s    = opaque;
    uint32_t previous_value = 0;
    const uint32_t value    = val64;

    trace_stm32f429_rcc_write(addr, value);

    switch (addr) {
    case A_CR:
        previous_value = s->cr;
        s->cr          = (s->cr & CR_READ_SET_MASK) |
                (value & (CR_READ_SET_MASK | ~CR_READ_ONLY_MASK));
        rcc_update_cr_register(s, previous_value);
        break;
    case A_PLLCFGR:
        s->pllcfgr = value;
        rcc_update_pllcfgr(s);
        break;
    case A_CFGR:
        s->cfgr = value & ~CFGR_READ_ONLY_MASK;
        rcc_update_cfgr_register(s);
        break;
    case A_CIR:
        qemu_log_mask(LOG_UNIMP,
                      "%s: not implemented for CIR\n", __func__);
        break;
    case A_PLLSAICFGR:
        s->pllsaicfgr = value;
        rcc_update_pllsaicfgr(s);
        break;
    case A_PLLI2SCFGR:
        s->plli2scfgr = value;
        rcc_update_plli2scfgr(s);
        break;
    /* Reset behaviors are not implemented */
    // case A_AHB1RSTR:
    //     s->ahb1rstr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB1RSTR\n", __func__);
    //     break;
    // case A_AHB2RSTR:
    //     s->ahb2rstr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB2RSTR\n", __func__);
    //     break;
    // case A_AHB3RSTR:
    //     s->ahb3rstr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB3RSTR\n", __func__);
    //     break;
    // case A_APB1RSTR1:
    //     s->apb1rstr1 = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB1RSTR1\n", __func__);
    //     break;
    // case A_APB1RSTR2:
    //     s->apb1rstr2 = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB1RSTR2\n", __func__);
    //     break;
    // case A_APB2RSTR:
    //     s->apb2rstr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB2RSTR\n", __func__);
    //     break;
    // case A_AHB1ENR:
    //     s->ahb1enr = value;
    //     rcc_update_ahb1enr(s);
    //     break;
    // case A_AHB2ENR:
    //     s->ahb2enr = value;
    //     rcc_update_ahb2enr(s);
    //     break;
    // case A_AHB3ENR:
    //     s->ahb3enr = value;
    //     rcc_update_ahb3enr(s);
    //     break;
    case A_APB1ENR1:
        s->apb1enr1 = value;
        rcc_update_apb1enr(s);
        break;
    // case A_APB1ENR2:
    //     s->apb1enr2 = value;
    //     rcc_update_apb1enr(s);
    //     break;
    // case A_APB2ENR:
    //     s->apb2enr = (s->apb2enr & APB2ENR_READ_SET_MASK) | value;
    //     rcc_update_apb2enr(s);
    //     break;
    // /* Behaviors for Sleep and Stop modes are not implemented */
    // case A_AHB1SMENR:
    //     s->ahb1smenr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB1SMENR\n", __func__);
    //     break;
    // case A_AHB2SMENR:
    //     s->ahb2smenr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB2SMENR\n", __func__);
    //     break;
    // case A_AHB3SMENR:
    //     s->ahb3smenr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for AHB3SMENR\n", __func__);
    //     break;
    // case A_APB1SMENR1:
    //     s->apb1smenr1 = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB1SMENR1\n", __func__);
    //     break;
    // case A_APB1SMENR2:
    //     s->apb1smenr2 = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB1SMENR2\n", __func__);
    //     break;
    // case A_APB2SMENR:
    //     s->apb2smenr = value;
    //     qemu_log_mask(LOG_UNIMP,
    //                   "%s: Side-effects not implemented for APB2SMENR\n", __func__);
    //     break;
    // case A_CCIPR:
    //     s->ccipr = value;
    //     rcc_update_ccipr(s);
    //     break;
    // case A_BDCR:
    //     s->bdcr = value & ~BDCR_READ_ONLY_MASK;
    //     rcc_update_bdcr(s);
    //     break;
    // case A_CSR:
    //     s->csr = value & ~CSR_READ_ONLY_MASK;
    //     rcc_update_csr(s);
    //     break;
    case A_DCKCFGR:
        s->dckcfgr = value;
        rcc_update_dckcfgr(s);
        break;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%" HWADDR_PRIx "\n", __func__, addr);
    }
}

static const MemoryRegionOps stm32f429_rcc_ops = {
    .read       = stm32f429_rcc_read,
    .write      = stm32f429_rcc_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .valid      = {
             .max_access_size = 4,
             .min_access_size = 4,
             .unaligned       = false},
    .impl = {.max_access_size = 4, .min_access_size = 4, .unaligned = false},
};

static const ClockPortInitArray stm32f429_rcc_clocks = {
    QDEV_CLOCK_IN(Stm32f429RccState, hsi16_rc, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, msi_rc, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, hse, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, lsi_rc, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, lse_crystal, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, sai1_extclk, NULL, 0),
    QDEV_CLOCK_IN(Stm32f429RccState, sai2_extclk, NULL, 0),
    QDEV_CLOCK_END};

static void stm32f429_rcc_init(Object *obj)
{
    Stm32f429RccState *s = STM32F429_RCC(obj);
    size_t i;

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->mmio, obj, &stm32f429_rcc_ops, s,
                          TYPE_STM32F429_RCC, 0x400);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);

    qdev_init_clocks(DEVICE(s), stm32f429_rcc_clocks);

