weber-lin-nthu/Sysmaker_QEMU/hw/misc/stm32f429_rcc.c
    for (i = 0; i < RCC_NUM_PLL; i++) {
        object_initialize_child(obj, PLL_INIT_INFO[i].name,
                                &s->plls[i], TYPE_RCC_PLL);
        set_pll_init_info(&s->plls[i], i);
    }

    for (i = 0; i < RCC_NUM_CLOCK_MUX; i++) {
        char *alias;

        object_initialize_child(obj, CLOCK_MUX_INIT_INFO[i].name,
                                &s->clock_muxes[i],
                                TYPE_RCC_CLOCK_MUX);
        set_clock_mux_init_info(&s->clock_muxes[i], i);

        if (!CLOCK_MUX_INIT_INFO[i].hidden) {
            /* Expose muxes output as RCC outputs */
            alias = g_strdup_printf("%s-out", CLOCK_MUX_INIT_INFO[i].name);
            qdev_alias_clock(DEVICE(&s->clock_muxes[i]), "out", DEVICE(obj), alias);
            g_free(alias);
        }
    }

    s->gnd = clock_new(obj, "gnd");
}

static void connect_mux_sources(Stm32f429RccState *s,
                                RccClockMuxState *mux,
                                const RccClockMuxSource *clk_mapping)
{
    size_t i;

    Clock *const CLK_SRC_MAPPING[] = {
        [RCC_CLOCK_MUX_SRC_GND] = s->gnd,
        [RCC_CLOCK_MUX_SRC_HSI] = s->hsi16_rc,
        [RCC_CLOCK_MUX_SRC_HSE] = s->hse,
        [RCC_CLOCK_MUX_SRC_LSI] = s->lsi_rc,
        [RCC_CLOCK_MUX_SRC_LSE] = s->lse_crystal,
        [RCC_CLOCK_MUX_SRC_PLLCLK] =
            s->plls[RCC_PLL_PLL].channels[RCC_PLL_CHANNEL_PLLCLK],
        [RCC_CLOCK_MUX_SRC_PLLI2SCLK] =
            s->plls[RCC_PLL_PLLI2S].channels[RCC_PLLI2S_CHANNEL_PLLI2SCLK],
        [RCC_CLOCK_MUX_SRC_PLLSAICLK_I2S] =
            s->plls[RCC_PLL_PLLI2S].channels[RCC_PLLI2S_CHANNEL_PLLSAICLK],
        [RCC_CLOCK_MUX_SRC_PLLSAICLK_SAI] =
            s->plls[RCC_PLL_PLLSAI].channels[RCC_PLLSAI_CHANNEL_PLLSAICLK],
        [RCC_CLOCK_MUX_SRC_PLLCDCLK] =
            s->plls[RCC_PLL_PLLSAI].channels[RCC_PLLSAI_CHANNEL_PLLCDCLK],
        [RCC_CLOCK_MUX_SRC_SYSCLK]  = s->clock_muxes[RCC_CLOCK_MUX_SYSCLK].out,
        [RCC_CLOCK_MUX_SRC_HCLK]    = s->clock_muxes[RCC_CLOCK_MUX_HCLK].out,
        [RCC_CLOCK_MUX_SRC_PCLK1]   = s->clock_muxes[RCC_CLOCK_MUX_PCLK1].out,
        [RCC_CLOCK_MUX_SRC_PCLK2]   = s->clock_muxes[RCC_CLOCK_MUX_PCLK2].out,
        [RCC_CLOCK_MUX_SRC_HSE_RTC] = s->clock_muxes[RCC_CLOCK_MUX_HSE_RTC].out,
        [RCC_CLOCK_MUX_SRC_RTCCLK] =
            s->clock_muxes[RCC_CLOCK_MUX_RTCCLK].out,
    };

    assert(ARRAY_SIZE(CLK_SRC_MAPPING) == RCC_CLOCK_MUX_SRC_NUMBER);

    for (i = 0; i < RCC_NUM_CLOCK_MUX_SRC; i++) {
        RccClockMuxSource mapping = clk_mapping[i];
        clock_set_source(mux->srcs[i], CLK_SRC_MAPPING[mapping]);
    }
}

static const VMStateDescription vmstate_stm32f429_rcc = {
    .name               = TYPE_STM32F429_RCC,
    .version_id         = 1,
    .minimum_version_id = 1,
    .fields             = (VMStateField[]){
        VMSTATE_UINT32(cr, Stm32f429RccState),
        VMSTATE_UINT32(pllcfgr, Stm32f429RccState),
        VMSTATE_UINT32(cir, Stm32f429RccState),
        VMSTATE_UINT32(cfgr, Stm32f429RccState),
        VMSTATE_UINT32(pllsaicfgr, Stm32f429RccState),
        VMSTATE_UINT32(plli2scfgr, Stm32f429RccState),
        // VMSTATE_UINT32(cier, Stm32f429RccState),
        // VMSTATE_UINT32(cifr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb1rstr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb2rstr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb3rstr, Stm32f429RccState),
        // VMSTATE_UINT32(apb1rstr1, Stm32f429RccState),
        // VMSTATE_UINT32(apb1rstr2, Stm32f429RccState),
        // VMSTATE_UINT32(apb2rstr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb1enr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb2enr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb3enr, Stm32f429RccState),
        VMSTATE_UINT32(apb1enr1, Stm32f429RccState),
        // VMSTATE_UINT32(apb1enr2, Stm32f429RccState),
        // VMSTATE_UINT32(apb2enr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb1smenr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb2smenr, Stm32f429RccState),
        // VMSTATE_UINT32(ahb3smenr, Stm32f429RccState),
        // VMSTATE_UINT32(apb1smenr1, Stm32f429RccState),
        // VMSTATE_UINT32(apb1smenr2, Stm32f429RccState),
        // VMSTATE_UINT32(apb2smenr, Stm32f429RccState),
        // VMSTATE_UINT32(ccipr, Stm32f429RccState),
        // VMSTATE_UINT32(bdcr, Stm32f429RccState),
        // VMSTATE_UINT32(csr, Stm32f429RccState),
        VMSTATE_UINT32(dckcfgr, Stm32f429RccState),
        VMSTATE_CLOCK(hsi16_rc, Stm32f429RccState),
        VMSTATE_CLOCK(msi_rc, Stm32f429RccState),
        VMSTATE_CLOCK(hse, Stm32f429RccState),
        VMSTATE_CLOCK(lsi_rc, Stm32f429RccState),
        VMSTATE_CLOCK(lse_crystal, Stm32f429RccState),
        VMSTATE_CLOCK(sai1_extclk, Stm32f429RccState),
        VMSTATE_CLOCK(sai2_extclk, Stm32f429RccState),
        VMSTATE_END_OF_LIST()}};

static void stm32f429_rcc_realize(DeviceState *dev, Error **errp)
{
    Stm32f429RccState *s = STM32F429_RCC(dev);
    size_t i;

    if (s->hse_frequency < 4000000ULL ||
        s->hse_frequency > 26000000ULL) {
        error_setg(errp,
                   "HSE frequency is outside of the allowed [4-26]Mhz range: %" PRIx64 "",
                   s->hse_frequency);
        return;
    }

    for (i = 0; i < RCC_NUM_PLL; i++) {
        RccPllState *pll = &s->plls[i];

        clock_set_source(pll->in, s->clock_muxes[RCC_CLOCK_MUX_PLL_INPUT].out);

        if (!qdev_realize(DEVICE(pll), NULL, errp)) {
            return;
        }
    }

    for (i = 0; i < RCC_NUM_CLOCK_MUX; i++) {
        RccClockMuxState *clock_mux = &s->clock_muxes[i];

        connect_mux_sources(s, clock_mux, CLOCK_MUX_INIT_INFO[i].src_mapping);

        if (!qdev_realize(DEVICE(clock_mux), NULL, errp)) {
            return;
        }
    }

    /*
     * Start clocks after everything is connected
     * to propagate the frequencies along the tree.
     */
    clock_update_hz(s->hsi16_rc, HSI_FRQ);
    clock_update_hz(s->sai1_extclk, s->sai1_extclk_frequency);
    clock_update_hz(s->sai2_extclk, s->sai2_extclk_frequency);
    clock_update(s->gnd, 0);
}

static Property stm32f429_rcc_properties[] = {
    DEFINE_PROP_UINT64("hse_frequency", Stm32f429RccState,
                       hse_frequency, HSE_DEFAULT_FRQ),
    DEFINE_PROP_UINT64("sai1_extclk_frequency", Stm32f429RccState,
                       sai1_extclk_frequency, 0),
    DEFINE_PROP_UINT64("sai2_extclk_frequency", Stm32f429RccState,
                       sai2_extclk_frequency, 0),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32f429_rcc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc     = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    assert(ARRAY_SIZE(CLOCK_MUX_INIT_INFO) == RCC_NUM_CLOCK_MUX);

    rc->phases.hold = stm32f429_rcc_reset_hold;
    device_class_set_props(dc, stm32f429_rcc_properties);
    dc->realize = stm32f429_rcc_realize;
    dc->vmsd    = &vmstate_stm32f429_rcc;
}

static const TypeInfo stm32f429_rcc_types[] = {
    {
        .name          = TYPE_STM32F429_RCC,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(Stm32f429RccState),
        .instance_init = stm32f429_rcc_init,
        .class_init    = stm32f429_rcc_class_init,
    },
    {
        .name          = TYPE_RCC_CLOCK_MUX,
        .parent        = TYPE_DEVICE,
        .instance_size = sizeof(RccClockMuxState),
        .instance_init = clock_mux_init,
        .class_init    = clock_mux_class_init,
    },
    {
        .name          = TYPE_RCC_PLL,
        .parent        = TYPE_DEVICE,
        .instance_size = sizeof(RccPllState),
        .instance_init = pll_init,
        .class_init    = pll_class_init,
    }};

DEFINE_TYPES(stm32f429_rcc_types)
